<h1 style="color:red" align="center">SQL WHERE Statement</h1>

## WHERE Statement in SQL

The WHERE statement in SQL is used to filter rows from a table based on specific conditions.

### Use Case

- **Purpose**: Filter rows based on specific conditions.
- **Usage**: Essential for extracting data that meets certain criteria, such as specific values, ranges, or patterns.


### Syntax
```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition;

**column1, column2, ...**: Columns you want to retrieve from the table.
**table_name**: Name of the table from which you want to retrieve data.
**condition**: Optional condition that specifies the criteria rows must meet to be included in the result set.

#### Use the ERD Diagram to understand and write queries :

![ERD.png](attachment:ERD.png)


### Common operator's used in WHERE Statements include :

* \> (greater than)

* \< (less than)

* \>= (greater than or equal to)

* \<= (less than or equal to)

* \= (equal to)

* \!= (not equal to)

### Example
Pulls the first 20 rows and all columns from the orders table that have a total_amt_usd less than 400.
```sql
  SELECT *
  FROM orders
  WHERE total_amt_usd <400
  LIMIT 20;
```

### WHERE Statement with Non-Numerical Data in SQL

The WHERE statement in SQL can also be used with non-numerical data to filter rows based on specific conditions.

#### The **WHERE** statement can also be used with **non-numeric data**. We can use the **= and **!=** operators here. You need to be sure to **use single quotes** (just be careful if you have quotes in the original text) with the text data, not double quotes.

#### Commonly when we are using WHERE with non-numeric data fields, we use the LIKE, NOT, or IN operators.


### Syntax
```sql
SELECT column1, column2, ...
FROM table_name
WHERE non_numerical_column = 'desired_value';

### Example

#### Filter the accounts table to include the company name, website, and the primary point of contact (primary_poc) just for the Exxon Robins company in the accounts table.

`SELECT name, website, primary_poc
FROM accounts
WHERE name = 'Exxon Robins';`

<h1 style="color:red">Arithmetic Operator's with WHERE Statement</h1>

#### Arithmetic operators can be used in conjunction with the WHERE statement in SQL to filter data based on mathematical conditions. These operators allow you to perform calculations and comparisons on numerical values within the database.

### Here are the common arithmetic operators used in SQL along with the WHERE statement :

## Addition

`SELECT * 
FROM table_name 
WHERE column_name1 + column_name2 = 200;`

## Subtraction

`SELECT * 
FROM table_name 
WHERE column_name1 - column_name2 > 10;`

## Multiplication

`SELECT * 
FROM table_name 
WHERE column_name1 * column_name2 = 520;`

## Division

`SELECT * 
FROM table_name 
WHERE column_name1 / column_name2 < 21;`

## Modulo

`SELECT * 
FROM table_name 
WHERE column_name1 % 2 = 0;`

<h1 style="color:white">Derived Columns</h1>

##### Creating a new column that is a combination of existing columns is known as a derived column. Usually you want to give a name, or "alias," to your new column using the AS keyword.

##### This derived column, and its alias, are generally only temporary, existing just for the duration of your query. The next time you run a query and access this table, the new column will not be there.

##### If you are deriving the new column from existing columns using a mathematical expression, then these familiar mathematical operators will be useful :

1. \* (Multiplication)
2. \+ (Addition)
3. \- (Subtraction)
4. \/ (Division)

### Example
```sql
  SELECT id, (standard_amt_usd/total_amt_usd)*100 AS std_percent, total_amt_usd
  FROM orders
  LIMIT 10;

```
#### Remember PEMDAS from math class to help remember the order of operations? The same order of operations applies when using arithmetic operators in SQL.

#### Exercises

1. Create a column that divides the standard_amt_usd by the standard_qty to find the unit price for standard paper for each order. Limit the results to the first 10 orders, and include the id and account_id fields.

```sql
  SELECT id,account_id,standard_amt_usd/standard_qty AS unit_price
  FROM orders
  LIMIT 10;
```

2. Write a query that finds the percentage of revenue that comes from poster paper for each order. You will need to use only the columns that end with \_usd. (Try to do this without using the total column.) Display the id and account_id fields also. NOTE - you will receive an error with the correct solution to this question. This occurs because at least one of the values in the data creates a division by zero in your formula. You will learn later in the course how to fully handle this issue. For now, you can just limit your calculations to the first 10 orders, as we did in question \#1, and you'll avoid that set of data that causes the problem.

```sql
  SELECT	id,account_id,poster_amt_usd/(standard_amt_usd + gloss_amt_usd + poster_amt_usd) AS post_per
  FROM orders
  LIMIT 10;
  '''